
@tombuildsstuff  - Hi, I have attached the terraform plan output here. Please have a look into it. 

Additionally, please provide me clarity over #5481 , as that is a different issue than this that I am facing.

```
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.azurerm_key_vault_secret.aksID: Refreshing state...
data.azurerm_key_vault_secret.mysqlSecret: Refreshing state...
module.common.azurerm_resource_group.main: Refreshing state... [id=/subscriptions/abc/resourceGroups/demo-rg-qa]
data.azurerm_key_vault_secret.aksSecret: Refreshing state...
module.common.azurerm_log_analytics_workspace.log_analytics: Refreshing state... [id=/subscriptions/abc/resourcegroups/demo-rg-qa/providers/microsoft.operationalinsights/workspaces/demologanalytics123-qaworkspace]
module.network.azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/virtualNetworks/test-VNET-qa]
module.compute.azurerm_public_ip.ingress_ip: Refreshing state... [id=/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/publicIPAddresses/demoqa-pip]
module.network.azurerm_subnet.subnet[0]: Refreshing state... [id=/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/virtualNetworks/test-VNET-qa/subnets/aks-subnet]
module.common.azurerm_log_analytics_solution.log_analytics_solution: Refreshing state... [id=/subscriptions/abc/resourcegroups/demo-rg-qa/providers/Microsoft.OperationsManagement/solutions/ContainerInsights(demoLogAnalytics123-qaworkspace)]
module.network.azurerm_network_security_group.subnetnsg: Refreshing state... [id=/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/networkSecurityGroups/subnet-nsg-qa]
module.network.azurerm_subnet_network_security_group_association.aks[0]: Refreshing state... [id=/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/virtualNetworks/test-VNET-qa/subnets/aks-subnet]
module.compute.azurerm_kubernetes_cluster.main: Refreshing state... [id=/subscriptions/abc/resourcegroups/demo-rg-qa/providers/Microsoft.ContainerService/managedClusters/demoqa-aks]
module.compute.local_file.kube_config: Refreshing state... [id=ca0ad39eea1da7118b4028d42094c1af6876dce9]
module.compute.kubernetes_namespace.asg_namespace: Refreshing state... [id=demo]
module.compute.kubernetes_service_account.tiller_sa: Refreshing state... [id=kube-system/tiller]
module.compute.data.helm_repository.jetstack: Refreshing state...
module.compute.kubernetes_cluster_role_binding.tiller_sa_cluster_admin_rb: Refreshing state... [id=tiller-cluster-role]
module.compute.helm_release.ingress: Refreshing state... [id=ingress]
module.compute.local_file.crdinstall: Refreshing state... [id=ca0ad39eea1da7118b4028d42094c1af6876dce9]
module.compute.helm_release.cert-manager: Refreshing state... [id=cert-manager]
module.compute.local_file.cert-manager-check: Refreshing state... [id=ca0ad39eea1da7118b4028d42094c1af6876dce9]
module.compute.helm_release.letsencrypt: Refreshing state... [id=letsencrypt]
module.compute.null_resource.create_tls_secret: Refreshing state... [id=5190578361720556348]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.compute.azurerm_kubernetes_cluster.main must be replaced
-/+ resource "azurerm_kubernetes_cluster" "main" {
      - api_server_authorized_ip_ranges = [] -> null
        dns_prefix                      = "demoqadnsprefix"
      ~ enable_pod_security_policy      = false -> (known after apply)
      ~ fqdn                            = "demoqadnsprefix-5369b596.hcp.eastus.azmk8s.io" -> (known after apply)
      ~ id                              = "/subscriptions/abc/resourcegroups/demo-rg-qa/providers/Microsoft.ContainerService/managedClusters/demoqa-aks" -> (known after apply)
      ~ kube_admin_config               = [] -> (known after apply)
      + kube_admin_config_raw           = (sensitive value)
      ~ kube_config                     = [
          - {
              - client_certificate     = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUUvVENDQXVXZ0F3SUJBZ0lSQUtSQS9yNVA1aC9WMTlIeDk4dUs3MW93RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdIaGNOTWpBd01USXlNVEl3TVRVeFdoY05Nakl3TVRJeE1USXhNVFV4V2pBdwpNUmN3RlFZRFZRUUtFdzV6ZVhOMFpXMDZiV0Z6ZEdWeWN6RVZNQk1HQTFVRUF4TU1iV0Z6ZEdWeVkyeHBaVzUwCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBOTh4UnhUalRtWU0vSDlJa3lzT0sKTmUvdTEybXphZEdFQ3h2OWN1MmxKYXlNWlRQa0twdXpqWkZTWUtDcGFmQ3A1anhQMXZEaDdodEZ2bWRYUWRxKwp4aU9BcFdoU3FpNDYyNDNIUzlaTnhZNWIvVWUyRzU1TEZ1cG1tT093QU44bXlPRlZuNkZZNGdZT3ptZEpsdWlvCm1KVi95d3NqSjVnbjZWdUZWUGk3bnFldE1OTkN1a2VHbGNLamplR2x3Tk9QYjRLNlpjZ2N5NVBMZ3RMaC9RWXUKbUpMUlY5Mkl2bEJDWDllVllpM1VWVkxPQXRkTUFsdERhTG9rd1Y0aXNwK1hIWTdqSVFjVml3YlYxci9YL05JUQovM0RKNm5YNzdkNDJ0TGVxRHBxL0tXQ1ljcEh2d2JxdDMweWRhUmF1c0oyWFFkU3M0Mm9MTFNpUVAramNsc2k4CmFvUkVpU1BsRENHMkRJVlAvZ2poZitIc3NGRHppcEFock04eEJSVEZaTUR6R1pIWnE3V0diMlRvdzVOOXdMaXMKTFpESVhRUEZzd0p3SmFzZzNja2FBbENUNDk5ZUhBWU5DTiticXpuUGFjTjFscjBPdnlRYmlFaStsVVZEamJ1QgpmR4aWJOWGV1SGxNTncwTm1xRXA3YkhHTDE3T3NIZTAyeWpUaDQzbWxpcy9MbWIKeWloZU83V2lQQWZ1RmFHQTZKTmt3YXlEMFV3ZWJ0SW56cVd3VE1jNVNLQVhlTjdDRFpMd1N6TE1oMWlsNGQwdQo0TURqaDM1ZXdCZnZqU0dFVVdpRm9OTUNBd0VBQWFNMU1ETXdEZ1lEVlIwUEFRSC9CQVFEQWdXZ01CTUdBMVVkCkpRUU1NQW9HQ0NzR0FRVUZCd01DTUF3R0ExVWRFd0VCL3dRQ01BQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUIKQUdXUkZMeTl6WTdrcTFBY3E3UTBUdUtNT3c5SnFybk1GeXpWKzd6bGRodHBhVlM5dXRlR0ZZUXNhZDZqOTE2awoxb01tTGswWDZEZXZTWUFpN2lTVVEyWXpreFduUjVjUndWdXRlYWwrM3VpRDB1RjNPWThvNmRYUm16U3RsV1g2CitQbmdFRWNYVGR2N3h2V0tpaWd2QkJBYnRmUXVzT3JBZUgrYUh3blpiUFJ5VzFRTmdRVVFnSDYxSC9wOXNSVHMKWjZ6dGpsck1CMDgzODVaWW5VMjU1QWY0Vlp4c1d1U0RONGFES1c4V0R5cTlEK3BQOTFyRStOamV6TStJQ0lLVQo2ZG1KbGUrcUFMT1pkYU1HdktBanVWVVkza1lWN0x0cElsSC9IcVlTckpnNG1wSHVJb3VYcnVKaEY5aEp6NDNmCnNBcGtWZEc2eXQyVmJSM2piYzQ0OS9GTjZaOVBOWUY1WUcyUTVsbFRjbnBpTkNHQ2RweHl2Z3U2VjNxbkZBK0UKTmJjVWh1RUlvc3BpU0RRUFVoTnpzWVdUZ0pPbnRrM0JCYjJsOGdvWjEwRGZMVG9WYmFyRytMNlJEOWsrZWJ1aAppM0k2eEtUY0JoTDNwMGFUMktrSGQ5TmlmQmFYczFtTmhjRzZTWWZSVTF1ZXRja0VKdnN6VHE3WStBRkxORS83Cm16MGM2V0dqbm9rb1pvdUtQWXhJWk1iYnZ2U1Znayt5cU81Q29haWdVRTlIOVRtZVl3SkNHa29zUFhwR2U2QTQKU0pNd3JkM0QvTnZCTzVROTVNR1AwcVovaXN4K09lQ1E3NkJkQ2dqc055NUV5N3A5ZThlVVh2VlNSWm1saVhtRgo3dFNHcVhwajNxek94K3RhbmVHV1h4KytqRFpRU21xNmlUR1J2cXorZ0JDVwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - client_key             = "LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBOTh4UnhUalRtWU0vSDlJa3lzT0tOZS91MTJtemFkR0VDeHY5Y3UybEpheU1aVFBrCktwdXpqWkZTWUtDcGFmQ3A1anhQMXZEaDdodEZ2bWRYUWRxK3hpT0FwV2hTcWk0NjI0M0hTOVpOeFk1Yi9VZTIKRzU1TEZ1cG1tT093QU44bXlPRlZuNkZZNGdZT3ptZEpsdWlvbUpWL3l3c2pKNWduNlZ1RlZQaTducWV0TU5OQwp1a2VHbGNLamplR2x3Tk9QYjRLNlpjZ2N5NVBMZ3RMaC9RWXVtSkxSVjkySXZsQkNYOWVWWWkzVVZWTE9BdGRNCkFsdERhTG9rd1Y0aXNwK1hIWTdqSVFjVml3YlYxci9YL05JUS8zREo2blg3N2Q0MnRMZXFEcHEvS1dDWWNwSHYKd2JxdDMweWRhUmF1c0oyWFFkU3M0Mm9MTFNpUVAramNsc2k4YW9SRWlTUGxEQ0cyRElWUC9namhmK0hzc0ZEegppcEFock04eEJSVEZaTUR6R1pIWnE3V0diMlRvdzVOOXdMaXNMWkRJWFFQRnN3SndKYXNnM2NrYUFsQ1Q0OTllCkhBWU5DTiticXpuUGFjTjFscjBPdnlRYmlFaStsVVZEamJ1Qm1MMHorZlY1OGpKS1ZzekJ3TkhaemZ4VTI0VWwKUFREdVVrYm53M2J1VEM0NDJ0dmc1SFJrMEpNcHZndFhNcFBlV0FXc1N4NXhMTERnNnJESmZiZHhpYk5YZXVIbApNTncwTm1xRXA3YkhHTDE3T3NIZTAyeWpUaDQzbWxpcy9MbWJ5aWhlTzdXaVBBZnVGYUdBNkpOa3dheUQwVXdlCmJ0SW56cVd3VE1jNVNLQVhlTjdDRFpMd1N6TE1oMWlsNGQwdTRNRGpoMzVld0JmdmpTR0VVV2lGb05NQ0F3RUEKQVFLQ0FnRUFuMW9jaDZqb29vTDllQmdxb3Q0bXBsTDZsRHFjTHdPV1Y1S1RaWElmenQ5c2xiUk9HWHh4ZGl1cQovd3F5aDdkRmV4TDBBUFI5UmlMeHNlVkEvcytOK1Z0aFluMTVFNG1SUGhtcHZVSStWem9hUEFIK3dUb0ZiZUlsClFsTEJuMzNoc2pMK1hoNWpTMDY3L00zOVMvZW9YQjlmeEJJUWRHanIyYXlLVEw5NzRDWlNRT0RLdTRJOXNWY3UKMkpId2h0VkdHMTdGUWFqem81TVN2N21mckpocUpLSGQwQlJkMkkxQ2NlSHdaZWUwOFgzRGo1NG1laWw0YXdPeAptVXhSSWU5eFBZZmkxaDE1SkNPc0ptTE9vZjN4QW1QazVVc2tUSzZuSFlZeTdSdGtyVlk2RXd0NFZHd1pYazBsCnVTdm1BUndHNWtXL1BLdTRMajAwcm5Td1RxTWVUbGwwK0NxQWgyVXdVMFJ6Y01uUlBOa2JKTFdmclJIeGRHQmEKZkI0UWhENzJ0Z28vOEN2NVNodHJOZmFVeDBkWkRYSkdQblN0NG01MlVvWWlpWFpaZDhINGJKTlFmc0xweWN3NgpwNHd6eGdJVEM5QlBIeDdzREI2S1JCMFZXa2oxV1h3amNGU0dTbllaV05jV3crU0FLRjA3OXVnbkVFMmUzcCtmCnlQOThLbEZma292YlA3VVV4NUJxKzFCUmlJUVA0UFNTQkJ0YUZQWXJYc05WMzEyL1ppM2FuUXpQbHRWVzVzTDIKT3pCRkdZdTBCdkdsZlV4YU4rMHpmMEFKQTBkNDEyMVJrMy9ZcTNxa3hRZ2NjbnVibWRKbnY1UEkxOVpOaUw5cgptWWtRbGhSWmlSWFRhallqMHRIVVAyRU55ZHpoMXdEd1huZDhaaWFyWlo3blBpSkNINEVDZ2dFQkFQa2JidHVvCjRpZ0NueWRwejBhZzRzUnRrVGZwSUNyVXkrbWlwaXZXd3c0TG5UUHlKUDR0Ck5DaWNwcDM5VXhydVRNRC9qbkxTMThVdkxmTm5EdDJkMFpJWUZGZzR2K3pZM3MwZkNEelJsVkt4cUxacS9aY08KQzhFekFQRHM1RlRIellUS3diQVhMSjFLdEUxQmVtRk9PUU9PQlVuc1dhU0xuTUFNRDFKL0thcCs1NkdDd3lnNwpHNzFzU0RWajZZbitXY0VDZ2dFQkFQNm5uUnpxU2g5RUR3OGxEYndiZzRQOWRheFAwd1ZBREhoYTV0TitSQlUwCkwrMmlzNXBjOWFuZVZaZUhMQ2p5bFJBd3MwV1FicWM2aWhUV3BDcHVDV2JtUVFNQjd1S0VLMWtDSmFtNjFJS1AKbHdwalRYbTB5bC9nYnJLR2M2MEl6T0taNXo4c0s3eGEzVUFBM2NORjhVSURMTmpnanBEYkF1OGtvVWVFYWx1SgoyQSt0a083NVhEMWo2YWlBQ1NaRnhTeFRORWJmVmlkSWE4NlhmNC96MWxPUnhvV1VPdXRpUEd0WmpKWmQ2YU9jCm51OG9rM2tLQXpMRzJFVDZiZXF3WWhsQThoOHBOT1FOaEVUSmsydTU1cTBrQmRuWmhZMFBUbkhZZENJemw4cDEKOGNLTDh1bDBadUlpb0xPWjF1eHowNUVVZHpHMDR0SW5mMWZFL20zWDE1TUNnZ0VCQUtOd20xaWx3dFNMZTg3Rgp0L3ZnSzVnQzlJSFdrekEzRFMrbHRnc2FZZkFKS1B2UTZJSXdiYzVDU3pLVHNRSUtRYUs0ZzFLSGp0MmdQeWNmCjR3Sk1yNHJZWlZ4QXgyOUxQYXN1d2s0RmJsNStvQUdMd0kvd1M1a0dKN3hIblQxOTBoM1BlMXlyNFY0azVkMFcKcW01a1pNaHhKbU1KQ3R2LzUzUzcxRzg3cWUxRkVpMkQyR1lodmpScFVldWJlZGppUjk5SU5YdExQMWlTQjBQTApiTlpUbWFwYlFpUVdNQm1nN2Q0d05QRzAxVWFzWTlUS1R5cGYxRGJ5OEYydkNQRDd2WDBLVDUzblNsRVZYTDIyClA4MWNWbnlVNTJYWW5wNEk0S2w3bDRiMllyUHhYNGp6K0pEY1JSbEFFR0dKSzFaQTgwcmwxNU95ekcySStRdUcKcFRpejJFRUNnZ0VBRlJSbzVBamM0K090WDNLUXhYNTlqNEorcUNuZmJQTFZWVzBvNkY3dVlkYjFGTFhBS2tvQgpwL01Zb0xkMngxajFUK2JJSUQwSmU5eFRxOC9zdlBwbzJ0UzZrdllwQVNVeHRXZUJHS0Mza0tzME5JN3R6ZUpTClVrZHd3bVJ3MU9VQ21NdG1vZ3NVLzcyQnpSZUZRL0haTzc2cGlyWmo5c2U2WVhObHlsYkN1eHNaQUlzOGtSdWgKTUEvQ09zbUdlRjJVS2N3bGFxeDRKRDVSZGtPQ01yZGJpWVZxcW9vUHFvWnlPK3lvdjVXOGptZWJuRzUrYnFtTwpoRGlEbElvcWFSLzZydDU2Ykd2cnplajBod0VzcStFeW9DaDRONFZURWM4dmppcjl5Z3I5U0t3a3ZCYjduNm1jCkRxSVJMV3pScHJjYnowbWphRUR4K2JWOVRCV3BmZ3c4OHdLQ0FRQW9MVUEvRCtCTWlIV2Nvd0NDTHhWeWY2a00KY1NzcWxsK1JnU09TRG5lY3FaV1BYMFRweWIyYVJlbk5GcEsyaFBHZjd2ODlDZVZTN3BxdXhjNFBkRENhNXd1eQpETUVUWTFTNTdmcm12TE80dERlS3JySDA5UXQ5KzR1TWZoYzEwZHRzZzNBV3Y2VnRtTG5KNmw1SG0xTXhnZUxqCmFPay9xVldtOWpyZzVyZ2p3cE5pVEc1U3JqSXgwRUZxY0JJc3JSaEVOeGQwNzg2RCtuT3RLd1k4U2hLc1dlY0QKbm5ENk1VSVIyQlo4R2J1dmpxcUFJMDVBUk8rYUtaaFBpVDJsMHp3Q1lpbWh5eTR0ZVRjTTFDN1hJOXBKS3MwbgptYjJuVFBvMlJDUG5PdVJRaFpHQXNwL3ZjbTQrVkNPdXU1K2dkN2ZSazREQy9NMlM0WGt2a2xKbkdncm4KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K"
              - cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5akNDQXJLZ0F3SUJBZ0lSQUkzSFJEZkVpWWVkZkNDcTRFdkNaR2t3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpBd01USXlNVEl3TVRVeFdoZ1BNakExTURBeE1UUXhNakV4TlRGYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCjR4dURtRk5MSlVzWWVkR29LdDQwRmMra2ozRDZRQmJxalRpMmJNdk9JT1ppaXBQM3NoM2ZtYmNpQ2lNdjU3Y0QKdVdNUzR6azBWVGh4eXNZRlg5b2hmRmJEbHNUTGdKSDRhUXFEQ1ZUVS9FcEU1TFI3WkVvVkU5YXVWeXIzcTA2VQoxUDhlcmRiM0FWTVFMTTdZeTRWUlhXVHF4MSt3Y25jeW1RMGJVUWNxQngvN3JjN0ZKaGRqTnBpNTVjZmViK0pzCi82R3VMN0dqc3BORDIyZDJhckJrTlc5UWV4QXlEcEJaeVA4TXZiOUx3Q3EwbXZHQlJvMzl0VE14UGhVVnVqRGwKQlN2bVlLTFRXUit2QXFRVFQwREVaOWZFaGQ0TjgydWl4L2N5aDdZZnNMUlczc1o3b1AreFg2d2xMTXhFVFUzWgphdDJvaHVKQjNwVmRvYXJTRk1ScUJFd3RVa1JVRUZXOHpoRFQ2QkRtbTliSTVvUTErRnVXSUdpdVJOMGhRMkpyCkt4eHc3MlJIZlBQUDVkK0kwWmJBSG4vT2tGczlrUytIdmQwMHJVQ0tLSlRkNXlFS1E5cUppL1BFbDFYZENQSSsKRG9GTm01dTZpOGQ1YmJ6QS9wb3hXZWtMMGxYK1NtY04weDV1OXZEa01pdXEvNU9aYmRIcmZDS0xXZXVENnFYNApBTGdKWm9ZRnZjTWtHd1lKc25VbVRxQ0w5VWdlSlAwU0pKUUxDY1hxLzFya3UKRlFSNVg0Nk1XZTYrVUhYU1Y1enBhZHRQekQ2ZlArT1ErYlc0QVhVTllpVUNBd0VBQWFNak1DRXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUJBQTRHCkc0NEkraGY5eVN2cW5xTWdYMytwUXA0UjRFQzB2R3JHbGQ0MTRqdDdsL1JXLytDWjJFM2JqTHdUYVUrQWZSdHgKTDZydjY2dDk1TFArNHBISUtvYW5VN2xVQUVHaVVaeElITU1rWGxRZVQzUUdMckxJSzRodzhnamxyTi9vdGNIVApjbmxHQ2xWcnJ3dklpcjJZTkhzVklWQitsUzZCVVZmNEc3NDFiU2pjaFI3ZmV4RjZ3OHJ1ZFRjTi9LV2UwZFBqCkZqVlpkcnM5Vk1HZms3NTVDZXR6QTM2dThaRlRQWlkvczJDTGpFdHlxVzFJenBFYWdXYUxCVHJZS2tadW1EWmwKbTVmSkUvb0UrdDN6bFFYeWdjZW51QjJVM2IzOUlNZ29FSlhqUy9Hdjh4b2tFUHAzRXhvbkE2U1YzSmtuTVROOQpXQWlHZ3Nqb0o3MUJTcThlbmcyMVA4bnN3cU90c2JIRnFDV0VqMGVNTVNrOGMyK2ZJN21qUDR0dGlVZFYzcUZMCmxGaSs3R0J4RWxvcjkyYWdYYjZRdVVwb0F0eUJXT1BMenpSNTJkWEFVVHFGVlJVbm9JeGNQTUptblZSWWdiZlkKUEF4WGxadG1oc2VwZW1yejh2ejdBb0lTNHdWTEVuV3pjZzJzRW4rWkZyVCtRT0Nxa01hbHpXSDVpZHBSVTJyOQpETUJHOU4xVk9hUFdiU056ZVRMTHV0UHVLK0FrNHVmWEx4MnZLc3ZLMlI0VVZjWVdhNnZtNVpsQ0NLOStSSzNZCllIOHFJQU1FMFBGNWNrNEJSbWFjRzB2aTRrUDB4Ui9QWkFINTlxKzhULytGdy9IMXBKSVIrejNZM245aUgveWsKQm1rQk1kUXBTa2d2TERnVGNRaVFPWHF4ZkU1RmFHNnVrR0RmN0VpWQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
              - host                   = "https://demoqadnsprefix-5369b596.hcp.eastus.azmk8s.io:443"
              - password               = "a16be882e7cfe98c6ad8b8c9ac3563e682e2bd90888c130dc690dc0d77376eee8c570e"
              - username               = "clusterUser_demo-rg-qa_demoqa-aks"
            },
        ] -> (known after apply)
      ~ kube_config_raw                 = (sensitive value)
        kubernetes_version              = "1.14.7"
        location                        = "eastus"
        name                            = "demoqa-aks"
      ~ node_resource_group             = "MC_demo-rg-qa_demoqa-aks_eastus" -> (known after apply)
        resource_group_name             = "demo-rg-qa"
      ~ tags                            = {} -> (known after apply)

        addon_profile {

            oms_agent {
                enabled                    = true
                log_analytics_workspace_id = "/subscriptions/abc/resourcegroups/demo-rg-qa/providers/microsoft.operationalinsights/workspaces/demologanalytics123-qaworkspace"
            }
        }

      ~ agent_pool_profile {
          ~ availability_zones    = [] -> (known after apply)
          ~ count                 = 2 -> (known after apply)
          + dns_prefix            = (known after apply)
          ~ enable_auto_scaling   = true -> (known after apply)
          ~ enable_node_public_ip = false -> (known after apply)
          ~ fqdn                  = "demoqadnsprefix-5369b596.hcp.eastus.azmk8s.io" -> (known after apply)
          ~ max_count             = 3 -> (known after apply)
          ~ max_pods              = 30 -> (known after apply)
          ~ min_count             = 2 -> (known after apply)
          ~ name                  = "default" -> (known after apply)
          ~ node_taints           = [] -> (known after apply)
          ~ os_disk_size_gb       = 100 -> (known after apply)
          ~ os_type               = "Linux" -> (known after apply)
          ~ type                  = "VirtualMachineScaleSets" -> (known after apply)
          ~ vm_size               = "Standard_D2s_v3" -> (known after apply)
          ~ vnet_subnet_id        = "/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/virtualNetworks/test-VNET-qa/subnets/aks-subnet" -> (known after apply)
        }

      ~ default_node_pool {
          - availability_zones    = [] -> null
            enable_auto_scaling   = true
          - enable_node_public_ip = false -> null
            max_count             = 3
          ~ max_pods              = 30 -> (known after apply)
            min_count             = 2
            name                  = "default"
          ~ node_count            = 2 -> (known after apply)
          - node_taints           = [] -> null
          ~ os_disk_size_gb       = 100 -> (known after apply)
            type                  = "VirtualMachineScaleSets"
            vm_size               = "Standard_D2s_v3"
          ~ vnet_subnet_id        = "/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/virtualNetworks/test-VNET-qa/subnets/aks-subnet" -> (known after apply) # forces replacement
        }

        linux_profile {
            admin_username = "adminuser"

            ssh_key {
                key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAAD8/jvzemqd2rBQ2uFMTi7f+C3n0sm9OGI9oSDVchbFmq+o4uX7i3TJf5JSlzr/VSi2CVc6+l6xIl9GjEE6FxhoMkeiTAMW3MFxYmQX+sPrHclPRoI5FCq1MzhabZ++ai3uNSUAwkolP7joaPGKC+AOv3yFWIE0x9dg2fIn/njEfdCbXCvZxiaijk6kfsTYz1MVuux3Hc1TbJ1vBpjkSoA04jNyG7mqP1Dd2us8bH2rX3yFLKikwuF8VdMG1a/RGNP8ECL/CTBdlcl582uPkd2+R37TJL+gQdn11y4r user@user"
            }
        }

      ~ network_profile {
            dns_service_ip     = "10.0.0.10"
            docker_bridge_cidr = "172.17.0.1/16"
          ~ load_balancer_sku  = "Basic" -> "basic"
            network_plugin     = "azure"
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
            service_cidr       = "10.0.0.0/16"
        }

        role_based_access_control {
            enabled = true
        }

        service_principal {
            client_id     = "a6aff433-b853-40d0-82fd-41c1323c42f02"
            client_secret = (sensitive value)
        }
    }

  # module.compute.local_file.cert-manager-check must be replaced
-/+ resource "local_file" "cert-manager-check" {
      ~ content              = <<~EOT
            apiVersion: v1
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5akNDQXJLZ0F3SUJBZ0lSQUkzSFJEZkVpWWVkZkNDcTRFdkNaR2t3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpBd01USXlNVEl3TVRVeFdoZ1BNakExTURBeE1UUXhNakV4TlRGYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCjR4dURtRk5MSlVzWWVkR29LdDQwRmMra2ozRDZRQmJxalRpMmJNdk9JT1ppaXBQM3NoM2ZtYmNpQ2lNdjU3Y0QKdVdNUzR6azBWVGh4eXNZRlg5b2hmRmJEbHNUTGdKSDRhUXFEQ1ZUVS9FcEU1TFI3WkVvVkU5YXVWeXIzcTA2VQoxUDhlcmRiM0FWTVFMTTdZeTRWUlhXVHF4MSt3Y25jeW1RMGJVUWNxQngvN3JjN0ZKaGRqTnBpNTVjZmViK0pzCi82R3VMN0dqc3BORDIyZDJhckJrTlc5UWV4QXlEcEJaeVA4TXZiOUx3Q3EwbXZHQlJvMzl0VE14UGhVVnVqRGwKQlN2bVlLTFRXUit2QXFRVFQwREVaOWZFaGQ0TjgydWl4L2N5aDdZZnNMUlczc1o3b1AreFg2d2xMTXhFVFUzWgphdDJvaHVKQjNwVmRvYXJTRk1ScUJFd3RVa1JVRUZXOHpoRFQ2QkRtbTliSTVvUTErRnVXSUdpdVJOMGhRMkpyCkt4eHc3MlJIZlBQUDVkK0kwWmJBSG4vT2tGczlrUytIdmQwMHJVQ0tLSlRkNXlFS1E5cUppL1BFbDFYZENQSSsKRG9GTm01dTZpOGQ1YmJ6QS9wb3hXZWtMMGxYK1NtY04weDV1OXZEa01pdXEvNU9aYmRIcmZDS0xXZXVENnFYNApBTGdHUlpoOU1FVjB5ZGxHWmJKdHE2UFlFeElaMlQ4WVVodFhmS2xKMVlEK3hMeXovd1puSmZFZ3dJOENPN29sCnZyWXREK1dWZVI1Y0Z2cFBTa0NNcDRKWm9ZRnZjTWtHd1lKc25VbVRxQ0w5VWdlSlAwU0pKUUxDY1hxLzFya3UKRlFSNVg0Nk1XZTYrVUhYU1Y1enBhZHRQekQ2ZlArT1ErYlc0QVhVTllpVUNBd0VBQWFNak1DRXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUJBQTRHCkc0NEkraGY5eVN2cW5xTWdYMytwUXA0UjRFQzB2R3JHbGQ0MTRqdDdsL1JXLytDWjJFM2JqTHdUYVUrQWZSdHgKTDZydjY2dDk1TFArNHBISUtvYW5VN2xVQUVHaVVaeElITU1rWGxRZVQzUUdMckxJSzRodzhnamxyTi9vdGNIVApjbmxHQ2xWcnJ3dklpcjJZTkhzVklWQitsUzZCVVZmNEc3NDFiU2pjaFI3ZmV4RjZ3OHJ1ZFRjTi9LV2UwZFBqCkZqVlpkcnM5Vk1HZms3NTVDZXR6QTM2dThaRlRQWlkvczJDTGpFdHlxVzFJenBFYWdXYUxCVHJZS2tadW1EWmwKbTVmSkUvb0UrdDN6bFFYeWdjZW51QjJVM2IzOUlNZ29FSlhqUy9Hdjh4b2tFUHAzRXhvbkE2U1YzSmtuTVROOQpXQWlHZ3Nqb0o3MUJTcThlbmcyMVA4bnN3cU90c2JIRnFDV0VqMGVNTVNrOGMyK2ZJN21qUDR0dGlVZFYzcUZMCmxGaSs3R0J4RWxvcjkyYWdYYjZRdVVwb0F0eUJXT1BMenpSNTJkWEFVVHFGVlJVbm9JeGNQTUptblZSWWdiZlkKUEF4WGxadG1oc2VwZW1yejh2ejdBb0lTNHdW4xVk9hUFdiU056ZVRMTHV0UHVLK0FrNHVmWEx4MnZLc3ZLMlI0VVZjWVdhNnZtNVpsQ0NLOStSSzNZCllIOHFJQU1FMFBGNWNrNEJSbWFjRzB2aTRrUDB4Ui9QWkFINTlxKzhULytGdy9IMXBKSVIrejNZM245aUgveWsKQm1rQk1kUXBTa2d2TERnVGNRaVFPWHF4ZkU1RmFHNnVrR0RmN0VpWQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                server: https://demoqadnsprefix-5369b596.hcp.eastus.azmk8s.io:443
              name: demoqa-aks
            contexts:
            - context:
                cluster: demoqa-aks
                user: clusterUser_demo-rg-qa_demoqa-aks
              name: demoqa-aks
            current-context: demoqa-aks
            kind: Config
            preferences: {}
            users:
            - name: clusterUser_demo-rg-qa_demoqa-aks
              user:
                client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUUvVENDQXVXZ0F3SUJBZ0lSQUtSQS9yNVA1aC9WMTlIeDk4dUs3MW93RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdIaGNOTWpBd01USXlNVEl3TVRVeFdoY05Nakl3TVRJeE1USXhNVFV4V2pBdwpNUmN3RlFZRFZRUUtFdzV6ZVhOMFpXMDZiV0Z6ZEdWeWN6RVZNQk1HQTFVRUF4TU1iV0Z6ZEdWeVkyeHBaVzUwCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBOTh4UnhUalRtWU0vSDlJa3lzT0sKTmUvdTEybXphZEdFQ3h2OWN1MmxKYXlNWlRQa0twdXpqWkZTWUtDcGFmQ3A1anhQMXZEaDdodEZ2bWRYUWRxKwp4aU9BcFdoU3FpNDYyNDNIUzlaTnhZNWIvVWUyRzU1TEZ1cG1tT093QU44bXlPRlZuNkZZNGdZT3ptZEpsdWlvCm1KVi95d3NqSjVnbjZWdUZWUGk3bnFldE1OTkN1a2VHbGNLamplR2x3Tk9QYjRLNlpjZ2N5NVBMZ3RMaC9RWXUKbUpMUlY5Mkl2bEJDWDllVllpM1VWVkxPQXRkTUFsdERhTG9rd1Y0aXNwK1hIWTdqSVFjVml3YlYxci9YL05JUQovM0RKNm5YNzdkNDJ0TGVxRHBxL0tXQ1ljcEh2d2JxdDMweWRhUmF1c0oyWFFkU3M0Mm9MTFNpUVAramNsc2k4CmFvUkVpU1BsRENHMkRJVlAvZ2poZitIc3NGRHppcEFock04eEJSVEZaTUR6R1pIWnE3V0diMlRvdzVOOXdMaXMKTFpESVhRUEZzd0p3SmFzZzNja2FBbENUNDk5ZUhBWU5DTiticXpuUGFjTjFscjBPdnlRYmlFaStsVVZEamJ1QgptTDB6K2ZWNThqSktWc3pCd05IWnpmeFUyNFVsUFREdVVrYm53M2J1VEM0NDJ0dmc1SFJrMEpNcHZndFhNcFBlCldBV3NTeDV4TExEZzZyREpmYmR4aWJOWGV1SGxNTncwTm1xRXA3YkhHTDE3T3NIZTAyeWpUaDQzbWxpcy9MbWIKeWloZU83V2lQQWZ1RmFHQTZKTmt3YXlEMFV3ZWJ0SW56cVd3VE1jNVNLQVhlTjdDRFpMd1N6TE1oMWlsNGQwdQo0TURqaDM1ZXdCZnZqU0dFVVdpRm9OTUNBd0VBQWFNMU1ETXdEZ1lEVlIwUEFRSC9CQVFEQWdXZ01CTUdBMVVkCkpRUU1NQW9HQ0NzR0FRVUZCd01DTUF3R0ExVWRFd0VCL3dRQ01BQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUIKQUdXUkZMeTl6WTdrcTFBY3E3UTBUdUtNT3c5SnFybk1GeXpWKzd6bGRodHBhVlM5dXRlR0ZZRlYWwrM3VpRDB1RjNPWThvNmRYUm16U3RsV1g2CitQbmdFRWNYVGR2N3h2V0tpaWd2QkJBYnRmUXVzT3JBZUgrYUh3blpiUFJ5VzFRTmdRVVFnSDYxSC9wOXNSVHMKWjZ6dGpsck1CMDgzODVaWW5VMjU1QWY0Vlp4c1d1U0RONGFES1c4V0R5cTlEK3BQOTFyRStOamV6TStJQ0lLVQo2ZG1KbGUrcUFMT1pkYU1HdktBanVWVVkza1lWN0x0cElsSC9IcVlTckpnNG1wSHVJb3VYcnVKaEY5aEp6NDNmCnNBcGtWZEc2eXQyVmJSM2piYzQ0OS9GTjZaOVBOWUY1WUcyUTVsbFRjbnBpTkNHQ2RweHl2Z3U2VjNxbkZBK0UKTmJjVWh1RUlvc3BpU0RRUFVoTnpzWVdUZ0pPbnRrM0JCYjJsOGdvWjEwRGZMVG9WYmFyRytMNlJEOWsrZWJ1aAppM0k2eEtUY0JoTDNwMGFUMktrSGQ5TmlmQmFYczFtTmhjRzZTWWZSVTF1ZXRja0VKdnN6VHE3WStBRkxORS83Cm16MGM2V0dqbm9rb1pvdUtQWXhJWk1iYnZ2U1Znayt5cU81Q29haWdVRTlIOVRtZVl3SkNHa29zUFhwR2U2QTQKU0pNd3JkM0QvTnZCTzVROTVNR1AwcVovaXN4K09lQ1E3NkJkQ2dqc055NUV5N3A5ZThlVVh2VlNSWm1saVhtRgo3dFNHcVhwajNxek94K3RhbmVHV1h4KytqRFpRU21xNmlUR1J2cXorZ0JDVwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBOTh4UnhUalRtWU0vSDlJa3lzT0tOZS91MTJtemFkR0VDeHY5Y3UybEpheU1aVFBrCktwdXpqWkZTWUtDcGFmQ3A1anhQMXZEaDdodEZ2bWRYUWRxK3hpT0FwV2hTcWk0NjI0M0hTOVpOeFk1Yi9VZTIKRzU1TEZ1cG1tT093QU44bXlPRlZuNkZZNGdZT3ptZEpsdWlvbUpWL3l3c2pKNWduNlZ1RlZQaTducWV0TU5OQwp1a2VHbGNLamplR2x3Tk9QYjRLNlpjZ2N5NVBMZ3RMaC9RWXVtSkxSVjkySXZsQkNYOWVWWWkzVVZWTE9BdGRNCkFsdERhTG9rd1Y0aXNwK1hIWTdqSVFjVml3YlYxci9YL05JUS8zREo2blg3N2Q0MnRMZXFEcHEvS1dDWWNwSHYKd2JxdDMweWRhUmF1c0oyWFFkU3M0Mm9MTFNpUVAramNsc2k4YW9SRWlTUGxEQ0cyRElWUC9namhmK0hzc0ZEegppcEFock04eEJSVEZaTUR6R1pIWnE3V0diMlRvdzVOOXdMaXNMWkRJWFFQRnN3SndKYXNnM2NrYUFsQ1Q0OTllCkhBWU5DTiticXpuUGFjTjFscjBPdnlRYmlFaStsVVZEamJ1Qm1MMHorZlY1OGpKS1ZzekJ3TkhaemZ4VTI0VWwKUFREdVVrYm53M2J1VEM0NDJ0dmc1SFJrMEpNcHZndFhNcFBlV0FXc1N4NXhMTERnNnJESmZiZHhpYk5YZXVIbApNTncwTm1xRXA3YkhHTDE3T3NIZTAyeWpUaDQzbWxpcy9MbWJ5aWhlTzdXaVBBZnVGYUdBNkpOa3dheUQwVXdlCmJ0SW56cVd3VE1jNVNLQVhlTjdDRFpMd1N6TE1oMWlsNGQwdTRNRGpoMzVld0JmdmpTR0VVV2lGb05NQ0F3RUEKQVFLQ0FnRUFuMW9jaDZqb29vTDllQmdxb3Q0bXBsTDZsRHFjTHdPV1Y1S1RaWElmenQ5c2xiUk9HWHh4ZGl1cQovd3F5aDdkRmV4TDBBUFI5UmlMeHNlVkEvcytOK1Z0aFluMTVFNG1SUGhtcHZVSStWem9hUEFIK3dUb0ZiZUlsClFsTEJuMzNoc2pMK1hoNWpTMDY3L00zOVMvZW9YQjlmeEJJUWRHanIyYXlLVEw5NzRDWlNRT0RLdTRJOXNWY3UKMkpId2h0VkdHMTdGUWFqem81TVN2N21mckpocUpLSGQwQlJkMkkxQ2NlSHdaZWUwOFgzRGo1NG1laWw0YXdPeAptVXhSSWU5eFBZZmkxaDE1SkNPc0ptTE9vZjN4QW1QazVVc2tUSzZuSFlZeTdSdGtyVlk2RXd0NFZHd1pYazBsCnVTdm1BUndHNWtXL1BLdTRMajAwcm5Td1RxTWVUbGwwK0NxQWgyVXdVMFJ6Y01uUlBOa2JKTFdmclJIeGRHQmEKZkI0UWhENzJ0Z28vOEN2NVNodHJOZmFVeDBkWkRYSkdQblN0NG01MlVvWWlpWFpaZDhINGJKTlFmc0xweWN3NgpwNHd6eGdJVEM5QlBIeDdzREI2S1JCMFZXa2oxV1h3amNGU0dTbllaV05jV3crU0FLRjA3OXVnbkVFMmUzcCtmCnlQOThLbEZma292YlA3VVV4NUJxKzFCUmlJUVA0UFNTQkJ0YUZQWXJYc05WMzEyL1ppM2FuUXpQbHRWVzVzTDIKT3pCRkdZdTBCdkdsZlV4YU4rMHpmMEFKQTBkNDEyMVJrMy9ZcTNxa3hRZ2NjbnVibWRKbnY1UEkxOVpOaUw5cgptWWtRbGhSWmlSWFRhallqMHRIVVAyRU55ZHpoMXdEd1huZDhaaWFyWlo3blBpSkNINEVDZ2dFQkFQa2JidHVvCjRpZ0NueWRrYjZ6N3lhSHZtMWMrdENsVTNZbmlxSitiZkRON1NhNlQyck43emo1aCtEclFzaXFveUl3N2pHWVAKODc0WmwrUWhuVzdRSTBwUm1nU3JJUktsRTNQNUpuaVZTNlB3WkgrTWoxQlphN1A0Z01GM0ZtajdETm9JQlVPUQpMZUQ0cGJhU05OQ2h4RnlOLzdvc0pzYTJlYlUwejBhZzRzUnRrVGZwSUNyVXkrbWlwaXZXd3c0TG5UUHlKUDR0Ck5DaWNwcDM5VXhydVRNRC9qbkxTMThVdkxmTm5EdDJkMFpJWUZGZzR2K3pZM3MwZkNEelJsVkt4cUxacS9aY08KQzhFekFQRHM1RlRIellUS3diQVhMSjFLdEUxQmVtRk9PUU9PQlVuc1dhU0xuTUFNRDFKL0thcCs1NkdDd3lnNwpHNzFzU0RWajZZbitXY0VDZ2dFQkFQNm5uUnpxU2g5RUR3OGxEYndiZzRQOWRheFAwd1ZBREhoYTV0TitSQlUwCkwrMmlzNXBjOWFuZVZaZUhMQ2p5bFJBd3MwV1FicWM2aWhUV3BDcHVDV2JtUVFNQjd1S0VLMWtDSmFtNjFJS1AKbHdwalRYbTB5bC9nYnJLR2M2MEl6T0taNXo4c0s3eGEzVUFBM2NORjhVSURMTmpnanBEYkF1OGtvVWVFYWx1SgoyQSt0a083NVhEMWo2YWlBQ1NaRnhTeFRORWJmVmlkSWE4NlhmNC96MWxPUnhvV1VPdXRpUEd0WmpKWmQ2YU9jCm51OG9rM2tLQXpMRzJFVDZiZXF3WWhsQThoOHBOT1FOaEVUSmsydTU1cTBrQmRuWmhZMFBUbkhZZENJemw4cDEKOGNLTDh1bDBadUlpb0xPWjF1eHowNUVVZHpHMDR0SW5mMWZFL20zWDE1TUNnZ0VCQUtOd20xaWx3dFNMZTg3Rgp0L3ZnSzVnQzlJSFdrekEzRFMrbHRnc2FZZkFKS1B2UTZJdMd0kvd1M1a0dKN3hIblQxOTBoM1BlMXlyNFY0azVkMFcKcW01a1pNaHhKbU1KQ3R2LzUzUzcxRzg3cWUxRkVpMkQyR1lodmpScFVldWJlZGppUjk5SU5YdExQMWlTQjBQTApiTlpUbWFwYlFpUVdNQm1nN2Q0d05QRzAxVWFzWTlUS1R5cGYxRGJ5OEYydkNQRDd2WDBLVDUzblNsRVZYTDIyClA4MWNWbnlVNTJYWW5wNEk0S2w3bDRiMllyUHhYNGp6K0pEY1JSbEFFR0dKSzFaQTgwcmwxNU95ekcySStRdUcKcFRpejJFRUNnZ0VBRlJSbzVBamM0K090WDNLUXhYNTlqNEorcUNuZmJQTFZWVzBvNkY3dVlkYjFGTFhBS2tvQgpwL01Zb0xkMngxajFUK2JJSUQwSmU5eFRxOC9zdlBwbzJ0UzZrdllwQVNVeHRXZUJHS0Mza0tzME5JN3R6ZUpTClVrZHd3bVJ3MU9VQ21NdG1vZ3NVLzcyQnpSZUZRL0haTzc2cGlyWmo5c2U2WVhObHlsYkN1eHNaQUlzOGtSdWgKTUEvQ09zbUdlRjJVS2N3bGFxeDRKRDVSZGtPQ01yZGJpWVZxcW9vUHFvWnlPK3lvdjVXOGptZWJuRzUrYnFtTwpoRGlEbElvcWFSLzZydDU2Ykd2cnplajBod0VzcStFeW9DaDRONFZURWM4dmppcjl5Z3I5U0t3a3ZCYjduNm1jCkRxSVJMV3pScHJjYnowbWphRUR4K2JWOVRCV3BmZ3c4OHdLQ0FRQW9MVUEvRCtCTWlIV2Nvd0NDTHhWeWY2a00KY1NzcWxsK1JnU09TRG5lY3FaV1BYMFRweWIyYVJlbk5GcEsyaFBHZjd2ODlDZVZTN3BxdXhjNFBkRENhNXd1eQpETUVUWTFTNTdmcm12TE80dERlS3JySDA5UXQ5KzR1TWZoYzEwZHRzZzNBV3Y2VnRtTG5KNmw1SG0xTXhnZUxqCmFPay9xVldtOWpyZzVyZ2p3cE5pVEc1U3JqSXgwRUZxY0JJc3JSaEVOeGQwNzg2RCtuT3RLd1k4U2hLc1dlY0QKbm5ENk1VSVIyQlo4R2J1dmpxcUFJMDVBUk8rYUtaaFBpVDJsMHp3Q1lpbWh5eTR0ZVRjTTFDN1hJOXBKS3MwbgptYjJuVFBvMlJDUG5PdVJRaFpHQXNwL3ZjbTQrVkNPdXU1K2dkN2ZSazREQy9NMlM0WGt2a2xKbkdncm4KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K
                token: a16be882e7cfe9096e63baed5f8a4a350aef9c7f3d65cb2f7a5fdfa4ca7f3cedfb7a23948c6ad8b8c9ac3563e682e2bd90888c130dc690dc0d77376eee8c570e
        EOT -> (known after apply) # forces replacement
        directory_permission = "0777"
        file_permission      = "0777"
        filename             = "/home/user/.kube/config"
      ~ id                   = "ca0ad39eea1da7118b4028d42094c1af6876dce9" -> (known after apply)
    }

  # module.compute.local_file.crdinstall must be replaced
-/+ resource "local_file" "crdinstall" {
      ~ content              = <<~EOT
            apiVersion: v1
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5akNDQXJLZ0F3SUJBZ0lSQUkzSFJEZkVpWWVkZkNDcTRFdkNaR2t3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpBd01USXlNVEl3TVRVeFdoZ1BNakExTURBeE1UUXhNakV4TlRGYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCjR4dURtRk5MSlVzWWVkR29LdDQwRmMra2ozRDZRQmJxalRpMmJNdk9JT1ppaXBQM3NoM2ZtYmNpQ2lNdjU3Y0QKdVdNUzR6azBWVGh4eXNZRlg5b2hmRmJEbHNUTGdKSDRhUXFEQ1ZUVS9FcEU1TFI3WkVvVkU5YXVWeXIzcTA2VQoxUDhlcmRiM0FWTVFMTTdZeTRWUlhXVHF4MSt3Y25jeW1RMGJVUWNxQngvN3JjN0ZKaGRqTnBpNTVjZmViK0pzCi82R3VMN0dqc3BORDIyZDJhckJrTlc5UWV4QXlEcEJaeVA4TXZiOUx3Q3EwbXZHQlJvMzl0VE14UGhVVnVqRGwKQlN2bVlLTFRXUit2QXFRVFQwREVaOWZFaGQ0TjgydWl4L2N5aDdZZnNMUlczc1o3b1AreFg2d2xMTXhFVFUzWgphdDJvaHVKQjNwVmRvYXJTRk1ScUJFd3RVa1JVRUZXOHpoRFQ2QkRtbTliSTVvUTErRnVXSUdpdVJOMGhRMkpyCkt4eHc3MlJIZlBQUDVkK0kwWmJBSG4vT2tGczlrUytIdmQwMHJVQ0tLSlRkNXlFS1E5cUppL1BFbDFYZENQSSsKRG9GTm01dTZpOGQ1YmJ6QS9wb3hXZWtMMGxYK1NtY04weDV1OXZEa01pdXEvNU9aYmRIcmZDS0xXZXVENnFYNApBTGdHUlpoOU1FVjB5ZGxHWmJKdHE2UFlFeElaMlQ4WVVodFhmS2xKMVlEK3hMeXovd1puSmZFZ3dJOENPN29sCnZyWXREK1dWZVI1Y0Z2cFBTa0NNcDRKWm9ZRnZjTWtHd1lKc25VbVRxQ0w5VWdlSlAwU0pKUUxDY1hxLzFya3UKRlFSNVg0Nk1XZTYrVUhYU1Y1enBhZHRQekQ2ZlArT1ErYlc0QVhVTllpVUNBd0VBQWFNak1DRXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUJBQTRHCkc0NEkraGY5eVN2cW5xTWdYMytwUXA0UjRFQzB2R3JHbGQ0MTRqdDdsL1JXLytDWjJFM2JqTHdUYVUrQWZSdHgKTDZydjY2dDk1TFArNHBISUtvYW5VN2xVQUVHaVVaeElITU1rWGxRZVQzUUdMckxJSzRodzhnamxyTi9vdGNIVApjbmxHQ2xWcnJ3dklpcjJZTkhzVklWQitsUzZCVVZmNEc3NDFiU2pjaFI3ZmV4RjZ3OHJ1ZFRjTi9LV2UwZFBqCkZqVlpkcnM5Vk1HZms3NTVDZXR6QTM2dThaRlRQWlkvczJDTGpFdHlxVzFJenBFYWdXYUxCVHJZS2tadW1EWmwKbTVmSkUvb0UrdDN6bFFYeWdjZW51QjJVM2IzOUlNZ29FSlhqUy9Hdjh4b2tFUHAzRXhvbkE2U1YzSmtuTVROOQpXQWlHZ3Nqb0o3MUJTcThlbmcyMVA4bnN3cU90c2JIRnFDV0VqMGVNTVNrOGMyK2ZJN21qUDR0dGlVZFYzcUZMCmxGaSs3R0J4RWxvcjkyYWdYYjZRdVVwb0F0eUJXT1BMenpSNTJkWEFVVHFGVlJVbm9JeGNQTUptblZSWWdiZlkKUEF4WGxadG1oc2VwZW1yejh2ejdBb0lTNHdWTEVuV3pjZzJzRW4rWkZyVCtRT0Nxa01hbHpXSDVpZHBSVTJyOQpETUJHOU4xVk9hUFdiU056ZVRMTHV0UHVLK0FrNHVmWEx4MnZLc3ZLMlI0VVZjWVdhNnZtNVpsQ0NLOStSSzNZCllIOHFJQU1FMFBGNWNrNEJSbWFjRzB2aTRrUDB4Ui9QWkFINTlxKzhULytGdy9IMXBKSVIrejNZM245aUgveWsKQm1rQk1kUXBTa2d2TERnVGNRaVFPWHF4ZkU1RmFHNnVrR0RmN0VpWQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                server: https://demoqadnsprefix-5369b596.hcp.eastus.azmk8s.io:443
              name: demoqa-aks
            contexts:
            - context:
                cluster: demoqa-aks
                user: clusterUser_demo-rg-qa_demoqa-aks
              name: demoqa-aks
            current-context: demoqa-aks
            kind: Config
            preferences: {}
            users:
            - name: clusterUser_demo-rg-qa_demoqa-aks
              user:
                client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUUvVENDQXVXZ0F3SUJBZ0lSQUtSQS9yNVA1aC9WMTlIeDk4dUs3MW93RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdIaGNOTWpBd01USXlNVEl3TVRVeFdoY05Nakl3TVRJeE1USXhNVFV4V2pBdwpNUmN3RlFZRFZRUUtFdzV6ZVhOMFpXMDZiV0Z6ZEdWeWN6RVZNQk1HQTFVRUF4TU1iV0Z6ZEdWeVkyeHBaVzUwCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBOTh4UnhUalRtWU0vSDlJa3lzT0sKTmUvdTEybXphZEdFQ3h2OWN1MmxKYXlNWlRQa0twdXpqWkZTWUtDcGFmQ3A1anhQMXZEaDdodEZ2bWRYUWRxKwp4aU9BcFdoU3FpNDYyNDNIUzlaTnhZNWIvVWUyRzU1TEZ1cG1tT093QU44bXlPRlZuNkZZNGdZT3ptZEpsdWlvCm1KVi95d3NqSjVnbjZWdUZWUGk3bnFldE1OTkN1a2VHbGNLamplR2x3Tk9QYjRLNlpjZ2N5NVBMZ3RMaC9RWXUKbUpMUlY5Mkl2bEJDWDllVllpM1VWVkxPQXRkTUFsdERhTG9rd1Y0aXNwK1hIWTdqSVFjVml3YlYxci9YL05JUQovM0RKNm5YNzdkNDJ0TGVxRHBxL0tXQ1ljcEh2d2JxdDMweWRhUmF1c0oyWFFkU3M0Mm9MTFNpUVAramNsc2k4CmFvUkVpU1BsRENHMkRJVlAvZ2poZitIc3NGRHppcEFock04eEJSVEZaTUR6R1pIWnE3V0diMlRvdzVOOXdMaXMKTFpESVhRUEZzd0p3SmFzZzNja2FBbENUNDk5ZUhBWU5DTiticXpuUGFjTjFscjBPdnlRYmlFaStsVVZEamJ1QgptTDB6K2ZWNThqSktWc3pCd05IWnpmeFUyNFVsUFREdVVrYm53M2J1VEM0NDJ0dmc1SFJrMEpNcHZndFhNcFBlCldBV3NTeDV4TExEZzZyREpmYmR4aWJOWGV1SGxNTncwTm1xRXA3YkhHTDE3T3NIZTAyeWpUaDQzbWxpcy9MbWIKeWloZU83V2lQQWZ1RmFHQTZKTmt3YXlEMFV3ZWJ0SW56cVd3VE1jNVNLQVhlTjdDRFpMd1N6TE1oMWlsNGQwdQo0TURqaDM1ZXdCZnZqU0dFVVdpRm9OTUNBd0VBQWFNMU1ETXdEZ1lEVlIwUEFRSC9CQVFEQWdXZ01CTUdBMVVkCkpRUU1NQW9HQ0NzR0FRVUZCd01DTUF3R0ExVWRFd0VCL3dRQ01BQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUIKQUdXUkZMeTl6WTdrcTFBY3E3UTBUdUtNT3c5SnFybk1GeXpWKzd6bGRodHBhVlM5dXRlR0ZZUXNhZDZqOTE2awoxb01tTGswWDZEZXZTWUFpN2lTVVEyWXpreFduUjVjUndWdXRlYWwrM3VpRDB1RjNPWThvNmRYUm16U3RsV1g2CitQbmdFRWNYVGR2N3h2V0tpaWd2QkJBYnRmUXVzT3JBZUgrYUh3blpiUFJ5VzFRTmdRVVFnSDYxSC9wOXNSVHMKWjZ6dGpsck1CMDgzODVaWW5VMjU1QWY0Vlp4c1d1U0RONGFES1c4V0R5cTlEK3BQOTFyRStOamV6TStJQ0lLVQo2ZG1KbGUrcUFMT1pkYU1HdktBanVWVVkza1lWN0x0cElsSC9IcVlTckpnNG1wSHVJb3VYcnVKaEY5aEp6NDNmCnNBcGtWZEc2eXQyVmJSM2piYzQ0OS9GTjZaOVBOWUY1WUcyUTVsbFRjbnBpTkNHQ2RweHl2Z3U2VjNxbkZBK0UKTmJjVWh1RUlvc3BpU0RRUFVoTnpzWVdUZ0pPbnRrM0JCYjJsOGdvWjEwRGZMVG9WYmFyRytMNlJEOWsrZWJ1aAppM0k2eEtUY0JoTDNwMGFUMktrSGQ5TmlmQmFYczFtTmhjRzZTWWZSVTF1ZXRja0VKdnN6VHE3WStBRkxORS83Cm16MGM2V0dqbm9rb1pvdUtQWXhJWk1iYnZ2U1Znayt5cU81Q29haWdVRTlIOVRtZVl3SkNHa29zUFhwR2U2QTQKU0pNd3JkM0QvTnZCTzVROTVNR1AwcVovaXN4K09lQ1E3NkJkQ2dqc055NUV5N3A5ZThlVVh2VlNSWm1saVhtRgo3dFNHcVhwajNxek94K3RhbmVHV1h4KytqRFpRU21xNmlUR1J2cXorZ0JDVwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBOTh4UnhUalRtWU0vSDlJa3lzT0tOZS91MTJtemFkR0VDeHY5Y3UybEpheU1aVFBrCktwdXpqWkZTWUtDcGFmQ3A1anhQMXZEaDdodEZ2bWRYUWRxK3hpT0FwV2hTcWk0NjI0M0hTOVpOeFk1Yi9VZTIKRzU1TEZ1cG1tT093QU44bXlPRlZuNkZZNGdZT3ptZEpsdWlvbUpWL3l3c2pKNWduNlZ1RlZQaTducWV0TU5OQwp1a2VHbGNLamplR2x3Tk9QYjRLNlpjZ2N5NVBMZ3RMaC9RWXVtSkxSVjkySXZsQkNYOWVWWWkzVVZWTE9BdGRNCkFsdERhTG9rd1Y0aXNwK1hIWTdqSVFjVml3YlYxci9YL05JUS8zREo2blg3N2Q0MnRMZXFEcHEvS1dDWWNwSHYKd2JxdDMweWRhUmF1c0oyWFFkU3M0Mm9MTFNpUVAramNsc2k4YW9SRWlTUGxEQ0cyRElWUC9namhmK0hzc0ZEegppcEFock04eEJSVEZaTUR6R1pIWnE3V0diMlRvdzVOOXdMaXNMWkRJWFFQRnN3SndKYXNnM2NrYUFsQ1Q0OTllCkhBWU5DTiticXpuUGFjTjFscjBPdnlRYmlFaStsVVZEamJ1Qm1MMHorZlY1OGpKS1ZzekJ3TkhaemZ4VTI0VWwKUFREdVVrYm53M2J1VEM0NDJ0dmc1SFJrMEpNcHZndFhNcFBlV0FXc1N4NXhMTERnNnJESmZiZHhpYk5YZXVIbApNTncwTm1xRXA3YkhHTDE3T3NIZTAyeWpUaDQzbWxpcy9MbWJ5aWhlTzdXaVBBZnVGYUdBNkpOa3dheUQwVXdlCmJ0SW56cVd3VE1jNVNLQVhlTjdDRFpMd1N6TE1oMWlsNGQwdTRNRGpoMzVld0JmdmpTR0VVV2lGb05NQ0F3RUEKQVFLQ0FnRUFuMW9jaDZqb29vTDllQmdxb3Q0bXBsTDZsRHFjTHdPV1Y1S1RaWElmenQ5c2xiUk9HWHh4ZGl1cQovd3F5aDdkRmV4TDBBUFI5UmlMeHNlVkEvcytOK1Z0aFluMTVFNG1SUGhtcHZVSStWem9hUEFIK3dUb0ZiZUlsClFsTEJuMzNoc2pMK1hoNWpTMDY3L00zOVMvZW9YQjlmeEJJUWRHanIyYXlLVEw5NzRDWlNRT0RLdTRJOXNWY3UKMkpId2h0VkdHMTdGUWFqem81TVN2N21mckpocUpLSGQwQlJkMkkxQ2NlSHdaZWUwOFgzRGo1NG1laWw0YXdPeAptVXhSSWU5eFBZZmkxaDE1SkNPc0ptTE9vZjN4QW1QazVVc2tUSzZuSFlZeTdSdGtyVlk2RXd0NFZHd1pYazBsCnVTdm1BUndHNWtXL1BLdTRMajAwcm5Td1RxTWVUbGwwK0NxQWgyVXdVMFJ6Y01uUlBOa2JKTFdmclJIeGRHQmEKZkI0UWhENzJ0Z28vOEN2NVNodHJOZmFVeDBkWkRYSkdQblN0NG01MlVvWWlpWFpaZDhINGJKTlFmc0xweWN3NgpwNHd6eGdJVEM5QlBIeDdzREI2S1JCMFZXa2oxV1h3amNGU0dTbllaV05jV3crU0FLRjA3OXVnbkVFMmUzcCtmCnlQOThLbEZma292YlA3VVV4NUJxKzFCUmlJUVA0UFNTQkJ0YUZQWXJYc05WMzEyL1ppM2FuUXpQbHRWVzVzTDIKT3pCRkdZdTBCdkdsZlV4YU4rMHpmMEFKQTBkNDEyMVJrMy9ZcTNxa3hRZ2NjbnVibWRKbnY1UEkxOVpOaUw5cgptWWtRbGhSWmlSWFRhallqMHRIVVAyRU55ZHpoMXdEd1huZDhaaWFyWlo3blBpSkNINEVDZ2dFQkFQa2JidHVvCjRpZ0NueWRrYjZ6N3lhSHZtMWMrdENsVTNZbmlxSitiZkRON1NhNlQyck43emo1aCtEclFzaXFveUl3N2pHWVAKODc0WmwrUWhuVzdRSTBwUm1nU3JJUktsRTNQNUpuaVZTNlB3WkgrTWoxQlphN1A0Z01GM0ZtajdETm9JQlVPUQpMZUQ0cGJhU05OQ2h4RnlOLzdvc0pzYTJlYlUwejBhZzRzUnRrVGZwSUNyVXkrbWlwaXZXd3c0TG5UUHlKUDR0Ck5DaWNwcDM5VXhydVRNRC9qbkxTMThVdkxmTm5EdDJkMFpJWUZGZzR2K3pZM3MwZkNEelJsVkt4cUxacS9aY08KQzhFekFQRHM1RlRIellUS3diQVhMSjFLdEUxQmVtRk9PUU9PQlVuc1dhU0xuTUFNRDFKL0thcCs1NkdDd3lnNwpHNzFzU0RWajZZbitXY0VDZ2dFQkFQNm5uUnpxU2g5RUR3OGxEYndiZzRQOWRheFAwd1ZBREhoYTV0TitSQlUwCkwrMmlzNXBjOWFuZVZaZUhMQ2p5bFJBd3MwV1FicWM2aWhUV3BDcHVDV2JtUVFNQjd1S0VLMWtDSmFtNjFJS1AKbHdwalRYbTB5bC9nYnJLR2M2MEl6T0taNXo4c0s3eGEzVUFBM2NORjhVSURMTmpnanBEYkF1OGtvVWVFYWx1SgoyQSt0a083NVhEMWo2YWlBQ1NaRnhTeFRORWJmVmlkSWE4NlhmNC96MWxPUnhvV1VPdXRpUEd0WmpKWmQ2YU9jCm51OG9rM2tLQXpMRzJFVDZiZXF3WWhsQThoOHBOT1FOaEVUSmsydTU1cTBrQmRuWmhZMFBUbkhZZENJemw4cDEKOGNLTDh1bDBadUlpb0xPWjF1eHowNUVVZHpHMDR0SW5mMWZFL20zWDE1TUNnZ0VCQUtOd20xaWx3dFNMZTg3Rgp0L3ZnSzVnQzlJSFdrekEzRFMrbHRnc2FZZkFKS1B2UTZJSXdiYzVDU3pLVHNRSUtRYUs0ZzFLSGp0MmdQeWNmCjR3Sk1yNHJZWlZ4QXgyOUxQYXN1d2s0RmJsNStvQUdMd0kvd1M1a0dKN3hIblQxOTBoM1BlMXlyNFY0azVkMFcKcW01a1pNaHhKbU1KQ3R2LzUzUzcxRzg3cWUxRkVpMkQyR1lodmpScFVldWJlZGppUjk5SU5YdExQMWlTQjBQTApiTlpUbWFwYlFpUVdNQm1nN2Q0d05QRzAxVWFzWTlUS1R5cGYxRGJ5OEYydkNQRDd2WDBLVDUzblNsRVZYTDIyClA4MWNWbnlVNTJYWW5wNEk0S2w3bDRiMllyUHhYNGp6K0pEY1JSbEFFR0dKSzFaQTgwcmwxNU95ekcySStRdUcKcFRpejJFRUNnZ0VBRlJSbzVBamM0K090WDNLUXhYNTlqNEorcUNuZmJQTFZWVzBvNkY3dVlkYjFGTFhBS2tvQgpwL01Zb0xkMngxajFUK2JJSUQwSmU5eFRxOC9zdlBwbzJ0UzZrdllwQVNVeHRXZUJHS0Mza0tzME5JN3R6ZUpTClVrZHd3bVJ3MU9VQ21NdG1vZ3NVLzcyQnpSZUZRL0haTzc2cGlyWmo5c2U2WVhObHlsYkN1eHNaQUlzOGtSdWgKTUEvQ09zbUdlRjJVS2N3bGFxeDRKRDVSZGtPQ01yZGJpWVZxcW9vUHFvWnlPK3lvdjVXOGptZWJuRzUrYnFtTwpoRGlEbElvcWFSLzZydDU2Ykd2cnplajBod0VzcStFeW9DaDRONFZURWM4dmppcjl5Z3I5U0t3a3ZCYjduNm1jCkRxSVJMV3pScHJjYnowbWphRUR4K2JWOVRCV3BmZ3c4OHdLQ0FRQW9MVUEvRCtCTWlIV2Nvd0NDTHhWeWY2a00KY1NzcWxsK1JnU09TRG5lY3FaV1BYMFRweWIyYVJlbk5GcEsyaFBHZjd2ODlDZVZTN3BxdXhjNFBkRENhNXd1eQpETUVUWTFTNTdmcm12TE80dERlS3JySDA5UXQ5KzR1TWZoYzEwZHRzZzNBV3Y2VnRtTG5KNmw1SG0xTXhnZUxqCmFPay9xVldtOWpyZzVyZ2p3cE5pVEc1U3JqSXgwRUZxY0JJc3JSaEVOeGQwNzg2RCtuT3RLd1k4U2hLc1dlY0QKbm5ENk1VSVIyQlo4R2J1dmpxcUFJMDVBUk8rYUtaaFBpVDJsMHp3Q1lpbWh5eTR0ZVRjTTFDN1hJOXBKS3MwbgptYjJuVFBvMlJDUG5PdVJRaFpHQXNwL3ZjbTQrVkNPdXU1K2dkN2ZSazREQy9NMlM0WGt2a2xKbkdncm4KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K
                token: a16be882e7cfe9096e63baed5f8a4a350aef9c7f3d65cb2f7a5fdfa4ca7f3cedfb7a23948c6ad8b8c9ac3563e682e2bd90888c130dc690dc0d77376eee8c570e
        EOT -> (known after apply) # forces replacement
        directory_permission = "0777"
        file_permission      = "0777"
        filename             = "/home/user/.kube/config"
      ~ id                   = "ca0ad39eea1da7118b4028d42094c1af6876dce9" -> (known after apply)
    }

  # module.compute.local_file.kube_config must be replaced
-/+ resource "local_file" "kube_config" {
      ~ content              = <<~EOT
            apiVersion: v1
            clusters:
            - cluster:
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUV5akNDQXJLZ0F3SUJBZ0lSQUkzSFJEZkVpWWVkZkNDcTRFdkNaR2t3RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdJQmNOTWpBd01USXlNVEl3TVRVeFdoZ1BNakExTURBeE1UUXhNakV4TlRGYQpNQTB4Q3pBSkJnTlZCQU1UQW1OaE1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBCjR4dURtRk5MSlVzWWVkR29LdDQwRmMra2ozRDZRQmJxalRpMmJNdk9JT1ppaXBQM3NoM2ZtYmNpQ2lNdjU3Y0QKdVdNUzR6azBWVGh4eXNZRlg5b2hmRmJEbHNUTGdKSDRhUXFEQ1ZUVS9FcEU1TFI3WkVvVkU5YXVWeXIzcTA2VQoxUDhlcmRiM0FWTVFMTTdZeTRWUlhXVHF4MSt3Y25jeW1RMGJVUWNxQngvN3JjN0ZKaGRqTnBpNTVjZmViK0pzCi82R3VMN0dqc3BORDIyZDJhckJrTlc5UWV4QXlEcEJaeVA4TXZiOUx3Q3EwbXZHQlJvMzl0VE14UGhVVnVqRGwKQlN2bVlLTFRXUit2QXFRVFQwREVaOWZFaGQ0TjgydWl4L2N5aDdZZnNMUlczc1o3b1AreFg2d2xMTXhFVFUzWgphdDJvaHVKQjNwVmRvYXJTRk1ScUJFd3RVa1JVRUZXOHpoRFQ2QkRtbTliSTVvUTErRnVXSUdpdVJOMGhRMkpyCkt4eHc3MlJIZlBQUDVkK0kwWmJBSG4vT2tGczlrUytIdmQwMHJVQ0tLSlRkNXlFS1E5cUppL1BFbDFYZENQSSsKRG9GTm01dTZpOGQ1YmJ6QS9wb3hXZWtMMGxYK1NtY04weDV1OXZEa01pdXEvNU9aYmRIcmZDS0xXZXVENnFYNApBTGdHUlpoOU1FVjB5ZGxHWmJKdHE2UFlFeElaMlQ4WVVodFhmS2xKMVlEK3hMeXovd1puSmZFZ3dJOENPN29sCnZyWXREK1dWZVI1Y0Z2cFBTa0NNcDRKWm9ZRnZjTWtHd1lKc25VbVRxQ0w5VWdlSlAwU0pKUUxDY1hxLzFya3UKRlFSNVg0Nk1XZTYrVUhYU1Y1enBhZHRQekQ2ZlArT1ErYlc0QVhVTllpVUNBd0VBQWFNak1DRXdEZ1lEVlIwUApBUUgvQkFRREFnS2tNQThHQTFVZEV3RUIvd1FGTUFNQkFmOHdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUJBQTRHCkc0NEkraGY5eVN2cW5xTWdYMytwUXA0UjRFQzB2R3JHbGQ0MTRqdDdsL1JXLytDWjJFM2JqTHdUYVUrQWZSdHgKTDZydjY2dDk1TFArNHBISUtvYW5VN2xVQUVHaVVaeElITU1rWGxRZVQzUUdMckxJSzRodzhnamxyTi9vdGNIVApjbmxHQ2xWcnJ3dklpcjJZTkhzVklWQitsUzZCVVZmNEc3NDFiU2pjaFI3ZmV4RjZ3OHJ1ZFRjTi9LV2UwZFBqCkZqVlpkcnM5Vk1HZms3NTVDZXR6QTM2dThaRlRQWlkvczJDTGpFdHlxVzFJenBFYWdXYUxCVHJZS2tadW1EWmwKbTVmSkUvb0UrdDN6bFFYeWdjZW51QjJVM2IzOUlNZ29FSlhqUy9Hdjh4b2tFUHAzRXhvbkE2U1YzSmtuTVROOQpXQWlHZ3Nqb0o3MUJTcThlbmcyMVA4bnN3cU90c2JIRnFDV0VqMGVNTVNrOGMyK2ZJN21qUDR0dGlVZFYzcUZMCmxGaSs3R0J4RWxvcjkyYWdYYjZRdVVwb0F0eUJXT1BMenpSNTJkWEFVVHFGVlJVbm9JeGNQTUptblZSWWdiZlkKUEF4WGxadG1oc2JyOQpETUJHOU4xVk9hUFdiU056ZVRMTHV0UHVLK0FrNHVmWEx4MnZLc3ZLMlI0VVZjWVdhNnZtNVpsQ0NLOStSSzNZCllIOHFJQU1FMFBGNWNrNEJSbWFjRzB2aTRrUDB4Ui9QWkFINTlxKzhULytGdy9IMXBKSVIrejNZM245aUgveWsKQm1rQk1kUXBTa2d2TERnVGNRaVFPWHF4ZkU1RmFHNnVrR0RmN0VpWQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                server: https://demoqadnsprefix-5369b596.hcp.eastus.azmk8s.io:443
              name: demoqa-aks
            contexts:
            - context:
                cluster: demoqa-aks
                user: clusterUser_demo-rg-qa_demoqa-aks
              name: demoqa-aks
            current-context: demoqa-aks
            kind: Config
            preferences: {}
            users:
            - name: clusterUser_demo-rg-qa_demoqa-aks
              user:
                client-certificate-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUUvVENDQXVXZ0F3SUJBZ0lSQUtSQS9yNVA1aC9WMTlIeDk4dUs3MW93RFFZSktvWklodmNOQVFFTEJRQXcKRFRFTE1Ba0dBMVVFQXhNQ1kyRXdIaGNOTWpBd01USXlNVEl3TVRVeFdoY05Nakl3TVRJeE1USXhNVFV4V2pBdwpNUmN3RlFZRFZRUUtFdzV6ZVhOMFpXMDZiV0Z6ZEdWeWN6RVZNQk1HQTFVRUF4TU1iV0Z6ZEdWeVkyeHBaVzUwCk1JSUNJakFOQmdrcWhraUc5dzBCQVFFRkFBT0NBZzhBTUlJQ0NnS0NBZ0VBOTh4UnhUalRtWU0vSDlJa3lzT0sKTmUvdTEybXphZEdFQ3h2OWN1MmxKYXlNWlRQa0twdXpqWkZTWUtDcGFmQ3A1anhQMXZEaDdodEZ2bWRYUWRxKwp4aU9BcFdoU3FpNDYyNDNIUzlaTnhZNWIvVWUyRzU1TEZ1cG1tT093QU44bXlPRlZuNkZZNGdZT3ptZEpsdWlvCm1KVi95d3NqSjVnbjZWdUZWUGk3bnFldE1OTkN1a2VHbGNLamplR2x3Tk9QYjRLNlpjZ2N5NVBMZ3RMaC9RWXUKbUpMUlY5Mkl2bEJDWDllVllpM1VWVkxPQXRkTUFsdERhTG9rd1Y0aXNwK1hIWTdqSVFjVml3YlYxci9YL05JUQovM0RKNm5YNzdkNDJ0TGVxRHBxL0tXQ1ljcEh2d2JxdDMweWRhUmF1c0oyWFFkU3M0Mm9MTFNpUVAramNsc2k4CmFvUkVpU1BsRENHMkRJVlAvZ2poZitIc3NGRHppcEFock04eEJSVEZaTUR6R1pIWnE3V0diMlRvdzVOOXdMaXMKTFpESVhRUEZzd0p3SmFzZzNja2FBbENUNDk5ZUhBWU5DTiticXpuUGFjTjFscjBPdnlRYmlFaStsVVZEamJ1QgptTDB6K2ZWNThqSktWc3pCd05IWnpmeFUyNFVsUFREdVVrYm53M2J1VEM0NDJ0dmc1SFJrMEpNcHZndFhNcFBlCldBV3NTeDV4TExEZzZyREpmYmR4aWJOWGV1SGxNTncwTm1xRXA3YkhHTDE3T3NIZTAyeWpUaDQzbWxpcy9MbWIKeWloZU83V2lQQWZ1RmFHQTZKTmt3YXlEMFV3ZWJ0SW56cVd3VE1jNVNLQVhlTjdDRFpMd1N6TE1oMWlsNGQwdQo0TURqaDM1ZXdCZnZqU0dFVVdpRm9OTUNBd0VBQWFNMU1ETXdEZ1lEVlIwUEFRSC9CQVFEQWdXZ01CTUdBMVVkCkpRUU1NQW9HQ0NzR0FRVUZCd01DTUF3R0ExVWRFd0VCL3dRQ01BQXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnSUIKQUdXUkZMeTl6WTdrcTFBY3E3UTBUdUtNT3c5SnFybk1GeXpWKzUjVjUndWdXRlYWwrM3VpRDB1RjNPWThvNmRYUm16U3RsV1g2CitQbmdFRWNYVGR2N3h2V0tpaWd2QkJBYnRmUXVzT3JBZUgrYUh3blpiUFJ5VzFRTmdRVVFnSDYxSC9wOXNSVHMKWjZ6dGpsck1CMDgzODVaWW5VMjU1QWY0Vlp4c1d1U0RONGFES1c4V0R5cTlEK3BQOTFyRStOamV6TStJQ0lLVQo2ZG1KbGUrcUFMT1pkYU1HdktBanVWVVkza1lWN0x0cElsSC9IcVlTckpnNG1wSHVJb3VYcnVKaEY5aEp6NDNmCnNBcGtWZEc2eXQyVmJSM2piYzQ0OS9GTjZaOVBOWUY1WUcyUTVsbFRjbnBpTkNHQ2RweHl2Z3U2VjNxbkZBK0UKTmJjVWh1RUlvc3BpU0RRUFVoTnpzWVdUZ0pPbnRrM0JCYjJsOGdvWjEwRGZMVG9WYmFyRytMNlJEOWsrZWJ1aAppM0k2eEtUY0JoTDNwMGFUMktrSGQ5TmlmQmFYczFtTmhjRzZTWWZSVTF1ZXRja0VKdnN6VHE3WStBRkxORS83Cm16MGM2V0dqbm9rb1pvdUtQWXhJWk1iYnZ2U1Znayt5cU81Q29haWdVRTlIOVRtZVl3SkNHa29zUFhwR2U2QTQKU0pNd3JkM0QvTnZCTzVROTVNR1AwcVovaXN4K09lQ1E3NkJkQ2dqc055NUV5N3A5ZThlVVh2VlNSWm1saVhtRgo3dFNHcVhwajNxek94K3RhbmVHV1h4KytqRFpRU21xNmlUR1J2cXorZ0JDVwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
                client-key-data: LS0tLS1CRUdJTiBSU0EgUFJJVkFURSBLRVktLS0tLQpNSUlKS1FJQkFBS0NBZ0VBOTh4UnhUalRtWU0vSDlJa3lzT0tOZS91MTJtemFkR0VDeHY5Y3UybEpheU1aVFBrCktwdXpqWkZTWUtDcGFmQ3A1anhQMXZEaDdodEZ2bWRYUWRxK3hpT0FwV2hTcWk0NjI0M0hTOVpOeFk1Yi9VZTIKRzU1TEZ1cG1tT093QU44bXlPRlZuNkZZNGdZT3ptZEpsdWlvbUpWL3l3c2pKNWduNlZ1RlZQaTducWV0TU5OQwp1a2VHbGNLamplR2x3Tk9QYjRLNlpjZ2N5NVBMZ3RMaC9RWXVtSkxSVjkySXZsQkNYOWVWWWkzVVZWTE9BdGRNCkFsdERhTG9rd1Y0aXNwK1hIWTdqSVFjVml3YlYxci9YL05JUS8zREo2blg3N2Q0MnRMZXFEcHEvS1dDWWNwSHYKd2JxdDMweWRhUmF1c0oyWFFkU3M0Mm9MTFNpUVAramNsc2k4YW9SRWlTUGxEQ0cyRElWUC9namhmK0hzc0ZEegppcEFock04eEJSVEZaTUR6R1pIWnE3V0diMlRvdzVOOXdMaXNMWkRJWFFQRnN3SndKYXNnM2NrYUFsQ1Q0OTllCkhBWU5DTiticXpuUGFjTjFscjBPdnlRYmlFaStsVVZEamJ1Qm1MMHorZlY1OGpKS1ZzekJ3TkhaemZ4VTI0VWwKUFREdVVrYm53M2J1VEM0NDJ0dmc1SFJrMEpNcHZndFhNcFBlV0FXc1N4NXhMTERnNnJESmZiZHhpYk5YZXVIbApNTncwTm1xRXA3YkhHTDE3T3NIZTAyeWpUaDQzbWxpcy9MbWJ5aWhlTzdXaVBBZnVGYUdBNkpOa3dheUQwVXdlCmJ0SW56cVd3VE1jNVNLQVhlTjdDRFpMd1N6TE1oMWlsNGQwdTRNRGpoMzVld0JmdmpTR0VVV2lGb05NQ0F3RUEKQVFLQ0FnRUFuMW9jaDZqb29vTDllQmdxb3Q0bXBsTDZsRHFjTHdPV1Y1S1RaWElmenQ5c2xiUk9HWHh4ZGl1cQovd3F5aDdkRmV4TDBBUFI5UmlMeHNlVkEvcytOK1Z0aFluMTVFNG1SUGhtcHZVSStWem9hUEFIK3dUb0ZiZUlsClFsTEJuMzNoc2pMK1hoNWpTMDY3L00zOVMvZW9YQjlmeEJJUWRHanIyYXlLVEw5NzRDWlNRT0RLdTRJOXNWY3UKMkpId2h0VkdHMTdGUWFqem81TVN2N21mckpocUpLSGQwQlJkMkkxQ2NlSHdaZWUwOFgzRGo1NG1laWw0YXdPeAptVXhSSWU5eFBZZmkxaDE1SkNPc0ptTE9vZjN4QW1QazVVc2tUSzZuSFlZeTdSdGtyVlk2RXd0NFZHd1pYazBsCnVTdm1BUndHNWtXL1BLdTRMajAwcm5Td1RxTWVUbGwwK0NxQWgyVXdVMFJ6Y01uUlBOa2JKTFdmclJIeGRHQmEKZkI0UWhENzJ0Z28vOEN2NVNodHJOZmFVeDBkWkRYSkdQblN0NG01MlVvWWlpWFpaZDhINGJKTlFmc0xweWN3NgpwNHd6eGdJVEM5QlBIeDdzREI2S1JCMFZXa2oxV1h3amNGU0dTbllaV05jV3crU0FLRjA3OXVnbkVFMmUzcCtmCnlQOThLbEZma292YlA3VVV4NUJxKzFCUmlJUVA0UFNTQkJ0YUZQWXJYc05WMzEyL1ppM2FuUXpQbHRWVzVzTDIKT3pCRkdZdTBCdkdsZlV4YU4rMHpmMEFKQTBkNDEyMVJrMy9ZcTNxa3hRZ2NjbnVibWRKbnY1UEkxOVpOaUw5cgptWWtRbGhSWmlSWFRhallqMHRIVVAyRU55ZHpoMXdEd1huZDhaaWFyWlo3blBpSkNINEVDZ2dFQkFQa2JidHVvCjRpZ0NueWRrYjZ6N3lhSHZtMWMrdENsVTNZbmlxSitiZkRON1NhNlQyck43emo1aCtEclFzaXFveUl3N2pHWVAKODc0WmwrUWhuVzdRSTBwUm1nU3JJUktsRTNQNUpuaVZTNlB3WkgrTWoxQlphN1A0Z01GM0ZtajdETm9JQlVPUQpMZUQ0cGJhU05OQ2h4RnlOLzdvc0pzYTJlYlUwejBhZzRzUnRrVGZwSUNyVXkrbWlwaXZXd3c0TG5UUHlKUDR0Ck5DaWNwcDM5VXhydVRNRC9qbkxTMThVdkxmTm5EdDJkMFpJWUZGZzR2K3pZM3MwZkNEelJsVkt4cUxacS9aY08KQzhFekFQRHM1RlRIellUS3diQVhMSjFLdEUxQmVtRk9PUU9PQlVuc1dhU0xuTUFNRDFKL0thcCs1NkdDd3lnNwpHNzFzU0RWajZZbitXY0VDZ2dFQkFQNm5uUnpxU2g5RUR3OGxEYndiZzRQOWRheFAwd1ZBREhoYTV0TitSQlUwCkwrMmlzNXBjOWFuZVZaZUhMQ2p5bFJBd3MwV1FicWM2aWhUV3BDcHVDV2JtUVFNQjd1S0VLMWtDSmFtNjFJS1AKbHdwalRYbTB5bC9nYnJLR2M2MEl6T0taNXo4c0s3eGEzVUFBM2NORjhVSURMTmpnanBEYkF1OGtvVWVFYWx1SgoyQSt0a083NVhEMWo2YWlBQ1NaRnhTeFRORWJmVmlkSWE4NlhmNC96MWxPUnhvV1VPdXRpUEd0WmpKWmQ2YU9jCm51OG9rM2tLQXpMRzJFVDZiZXF3WWhsQThoOHBOT1FOaEVUSmsydTU1cTBrQmRuWmhZMFBUbkhZZENJemw4cDEKOGNLTDh1bDBadUlpb0xPWjF1eHowNUVVZHpHMDR0SW5mMWZFL20zWDE1TUNnZ0VCQUtOd20xaWx3dFNMZTg3Rgp0L3ZnSzVnQzlJSFdrekEzRFMrbHRnc2FZZkFKS1B2UTZJSXdiYzVDU3pLVHNRSUtRYUs0ZzFLSGp0MmdQeWNmCjR3Sk1yNHJZWlZ4QXgyOUxQYXN1d2s0RmJsNStvQUdMd0kvd1M1a0dKN3hIblQxOTBoM1BlMXlyNFY0azVkMFcKcW01a1pNaHhKbU1KQ3R2LzUzUzcxRzg3cWUxRkVpMkQyR1lodmpScFVldWJlZGppUjk5SU5YdExQMWlTQjBQTApiTlpUbWFwYlFpUVdNQm1nN2Q0d05QRzAxVWFzWTlUS1R5cGYxRGJ5OEYydkNQRDd2WDBLVDUzblNsRVZYTDIyClA4MWNWbnlVNTJYWW5wNEk0S2w3bDRiMllyUHhYNGp6K0pEY1JSbEFFR0dKSzFaQTgwcmwxNU95ekcySStRdUcKcFRpejJFRUNnZ0VBRlJSbzVBamM0K090WDNLUXhYNTlqNEorcUNuZmJQTFZWVzBvNkY3dVlkYj9zdlBwbzJ0UzZrdllwQVNVeHRXZUJHS0Mza0tzME5JN3R6ZUpTClVrZHd3bVJ3MU9VQ21NdG1vZ3NVLzcyQnpSZUZRL0haTzc2cGlyWmo5c2U2WVhObHlsYkN1eHNaQUlzOGtSdWgKTUEvQ09zbUdlRjJVS2N3bGFxeDRKRDVSZGtPQ01yZGJpWVZxcW9vUHFvWnlPK3lvdjVXOGptZWJuRzUrYnFtTwpoRGlEbElvcWFSLzZydDU2Ykd2cnplajBod0VzcStFeW9DaDRONFZURWM4dmppcjl5Z3I5U0t3a3ZCYjduNm1jCkRxSVJMV3pScHJjYnowbWphRUR4K2JWOVRCV3BmZ3c4OHdLQ0FRQW9MVUEvRCtCTWlIV2Nvd0NDTHhWeWY2a00KY1NzcWxsK1JnU09TRG5lY3FaV1BYMFRweWIyYVJlbk5GcEsyaFBHZjd2ODlDZVZTN3BxdXhjNFBkRENhNXd1eQpETUVUWTFTNTdmcm12TE80dERlS3JySDA5UXQ5KzR1TWZoYzEwZHRzZzNBV3Y2VnRtTG5KNmw1SG0xTXhnZUxqCmFPay9xVldtOWpyZzVyZ2p3cE5pVEc1U3JqSXgwRUZxY0JJc3JSaEVOeGQwNzg2RCtuT3RLd1k4U2hLc1dlY0QKbm5ENk1VSVIyQlo4R2J1dmpxcUFJMDVBUk8rYUtaaFBpVDJsMHp3Q1lpbWh5eTR0ZVRjTTFDN1hJOXBKS3MwbgptYjJuVFBvMlJDUG5PdVJRaFpHQXNwL3ZjbTQrVkNPdXU1K2dkN2ZSazREQy9NMlM0WGt2a2xKbkdncm4KLS0tLS1FTkQgUlNBIFBSSVZBVEUgS0VZLS0tLS0K
                token: a16be882e7cfe9065cb2f7a5fdfa4ca7f3cedfb7a23948c6ad8b8c9ac3563e682e2bd90888c130dc690dc0d77376eee8c570e
        EOT -> (known after apply) # forces replacement
        directory_permission = "0777"
        file_permission      = "0777"
        filename             = "/home/user/.kube/config"
      ~ id                   = "ca0ad39eea1da7118b4028d42094c1af6876dce9" -> (known after apply)
    }

  # module.network.data.azurerm_subnet.subnetdata[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_subnet" "subnetdata"  {
      + address_prefix                                 = (known after apply)
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "aks-subnet"
      + network_security_group_id                      = (known after apply)
      + resource_group_name                            = "demo-rg-qa"
      + route_table_id                                 = (known after apply)
      + service_endpoints                              = (known after apply)
      + virtual_network_name                           = "test-VNET-qa"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.network.azurerm_subnet.subnet[0] will be updated in-place
  ~ resource "azurerm_subnet" "subnet" {
        address_prefix                                 = "10.20.0.0/20"
        enforce_private_link_endpoint_network_policies = false
        enforce_private_link_service_network_policies  = false
        id                                             = "/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/virtualNetworks/test-VNET-qa/subnets/aks-subnet"
        ip_configurations                              = [
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig1",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig10",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig11",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig12",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig13",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig14",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig15",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig16",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig17",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig18",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig19",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig2",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig20",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig21",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig22",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig23",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig24",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig25",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig26",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig27",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig28",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig29",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig3",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig30",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig31",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig4",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig5",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig6",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig7",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig8",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/0/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig9",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig1",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig10",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig11",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig12",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig13",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig14",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig15",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig16",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig17",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig18",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig19",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig2",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig20",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig21",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig22",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig23",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig24",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig25",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig26",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig27",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig28",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig29",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig3",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig30",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig31",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig4",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig5",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig6",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig7",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig8",
            "/subscriptions/abc/resourceGroups/MC_demo-rg-qa_demoqa-aks_eastus/providers/Microsoft.Compute/virtualMachineScaleSets/aks-default-28510694-vmss/virtualMachines/1/networkInterfaces/aks-default-28510694-vmss/ipConfigurations/ipconfig9",
        ]
        name                                           = "aks-subnet"
      - network_security_group_id                      = "/subscriptions/abc/resourceGroups/demo-rg-qa/providers/Microsoft.Network/networkSecurityGroups/subnet-nsg-qa" -> null
        resource_group_name                            = "demo-rg-qa"
        service_endpoints                              = []
        virtual_network_name                           = "test-VNET-qa"
    }

Plan: 4 to add, 1 to change, 4 to destroy.


```